Revit 2027 API
DuctFittingAndAccessoryPressureDropItem.EndConnectorIndex Property
 The index of the end conector of the flow path.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int EndConnectorIndex { get; }
Public ReadOnly Property EndConnectorIndex As Integer
	Get
public:
property int EndConnectorIndex {
	int get ();
}
member EndConnectorIndex : int with get
Property Value
Int32
See Also
Reference
DuctFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Mechanical Namespace